org/projects/cpp_tips.org
#+OPTIONS: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK")
#+OPTIONS: date:t e:t email:nil f:t inline:t num:t p:nil pri:nil
#+OPTIONS: prop:nil stat:t tags:t tasks:t tex:t timestamp:t title:t
#+OPTIONS: toc:nil todo:t |:t


#+TITLE:C++ things to think about while programming
#+OPTIONS: ':nil -:nil ^:{} num:nil toc:nil
#+AUTHOR: Stanislav Arnaudov
#+DATE: <2018-07-27 Fri>
#+EMAIL: stanislav_ts@abv.bg
#+CREATOR: Emacs 25.2.2 (Org mode 9.1.13 + ox-hugo)
#+HUGO_FRONT_MATTER_FORMAT: toml
#+HUGO_LEVEL_OFFSET: 1
#+HUGO_PRESERVE_FILLING:
#+HUGO_SECTION: projects

#+HUGO_BASE_DIR: ~/code/blog-hugo-files

#+HUGO_PREFER_HYPHEN_IN_TAGS: t 
#+HUGO_ALLOW_SPACES_IN_TAGS: nil
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_DATE_FORMAT: %Y-%m-%dT%T%z
#+DESCRIPTION: Several tips that I've explained to myself after I read Effective Modern C++
#+HUGO_DRAFT: false
#+KEYWORDS: c++ programming code type-deduction rvalue lvalue template
#+HUGO_TAGS: 
#+HUGO_CATEGORIES: c++
#+HUGO_WEIGHT: 100


* Abstract
C++ is hard! C++ is even harder when you want to write a good code. There are a lot of things to think about when your write code and if you don't think about them, you are probable going to mess things up. Recently I've found that one good book (see references) that gives 42 (hehe!) concrete tips on how to be a better c++ programmer. This is my summary of sorts about the contents of said book.

* The cool new things
** Rvalue, lvalue and move semantics
<<sec:move-semantics>>
"Move semantics" is a thing that we have in C++ now (since C++11 actually). It makes a ton of sense once you get it but it may be a little hard to wrap your head around it. At lest in the beginning, of course. First off - why do we need move semantics? For code efficiency! If you now what you are doing, your code can run faster, with fewer object copies and fewer objects created. Second, and perhaps more importantly, what are move semantics? The way I like to think about it - the ability to distinguish between object that won't be needed after the evaluation of an expression and the ability to do a different thing, if you are dealing with such object.\\
Take a look at the following code:
#+BEGIN_SRC c++
MyObject obj1, obj2;
MyObject new_obj = obj1 + obj2;
#+END_SRC
Lets say that the part ~obj1 + obj2~ creates a new object. This new object then gets copied through the copy assignment operator of the class ~MyObject~. This creates another object that is stored in the ~new_object~ variable. All in all, two object were created in this situation. The object that was originally created by ~obj1 + obj2~ is... well, gone. We just copied it and threw it away. Shame on us! Wouldn't it have been nice, if we could have just used that object and just "moved" it in ~new_obj~. Yes, yes it would! And yes, it is possible. Through move semantics. Those kind of object that won't continue to live after the expression evaluation are called *rvalue* object. All other objects are *lvalue*. In the class ~MyObject~ we can define a special kind of constructor (move constructor) that "creates" object from rvalues, i. e. "moves" the data from the given object in **this*. So,
- Lvalue - an object that can be used on left hand side of an expression; an object with identifiable address;
- Rvalue - an object that won't persist after the evaluation of a given expression; no identifiable address
/Note:/ Every value is either an lvalue or an rvalue!
** Auto
Type deduction for variables. Almost the same rules as the template arguments type deduction with one small caveat. Also, in a lot of cases it allows you to write more efficient code. Example to get you going:
#+BEGIN_SRC c++
std::unordered_map<std::string, std::string> map;
for(auto it : map){...} //just look how simple that is!!!
#+END_SRC

** Smart pointers
<<sec:smart-pointers>>
For an year now, I only hear how the C++ gurus scream how raw pointers are dangerous and will probably cause memory leaks when used so... smart pointers! For the price of a tiny bit of overhead, you will make harder (but not impossible!) for yourself to do something stupid with your code. Your new two best friends are ~shared_ptr<>~ and ~unique_ptrt<>~:
#+BEGIN_SRC c++
std::shared_ptr<int> int_ptr = std::maked_shared<int>(2);
std::unique_ptr<float> float_ptr = std::make_unique<float>(3.3);
#+END_SRC

When it comes to ~unique_ptr~, it's important to know how does one transfer the ownership of an object.
#+BEGIN_SRC c++
void take_ownership(std::unique_ptr<float> ptr)
{
  ... // now the pointer is mine!
}
std::unique_ptr<int[]> int_arr_ptr = std::make_unique<int[]>(10);
take_ownership(std::move(int_arr_ptr));
#+END_SRC

~shared_ptr~, on the other hand, can share their ownership. Again, it's good to know how is this done because you can messed it up.
#+BEGIN_SRC c++
class PtrHolder {
public:
  void save_ptr(std::shared_ptr<int> ptr)
    {  
      this->ptr_ = ptr;
    }
private:
  std::shared_ptr<int> ptr_;
}
int main(int argc, char *argv[])
{
  Ptrholder obj;
  std::shared_ptr<int> int_ptr = std::maked_shared<int>(2);
  obj.save_ptr(int_ptr); // know there are two references to the int of int_ptr
}
#+END_SRC
*Important:* _Do not_ return or take smart pointers by reference! 
\\
Creating factory methods is also relatively straightforward. Just return them by value! There is however one things to remember about ~unique_ptr~ - if the return type does not match the thing you are returning, you ought to use ~std::move~. This holds true even, if the return of the function type is a base class and you are returning derived class (explained [[https://stackoverflow.com/questions/39478956/how-does-returning-stdmake-uniquesubclass-work/39479117][here]]).

** Some random abbreviations
It is well knows fact that C++ programmers love their abbreviations. And you know what, it actually makes a lot sense to know those. The abbreviations in the C++ world reveal some really cool, useful and right out elegant concepts that everyone should know about. Also, just to be prepared, C++ programmers are also really bad at naming things.

|---------------+----------------------------------------|
| Abbreviations | Expansion                              |
|---------------+----------------------------------------|
|---------------+----------------------------------------|
| RAII          | Resource acquisition is initialization |
|---------------+----------------------------------------|
| SFINAE        | Substitution failure is not an error   |
|---------------+----------------------------------------|
| Pimple        | Pointer to implementation              |
|---------------+----------------------------------------|
| CRTP          | Curiously recurring template pattern   |
|---------------+----------------------------------------|
| IIFE          | Immediately function expression        |
|---------------+----------------------------------------|
| RVO           | Return value optimization              |
|---------------+----------------------------------------|
|---------------+----------------------------------------|
* Tips
** Knowing your template type deduction is a bless.
So every C++ programmer knows how you can define generic "templetized" functions and then you can call them with different types of arguments. The calling itself will cause the compiler to instantiate the function by replacing the generic type with the deduced type. The thing you should know in this process - how the type is being deduced when it's not given explicitly (i. e.the function is called without the <>-brackets).
\\
So, based on ~T~, ~ParamType~ and ~expr~ you have to know what type would be deduced in
#+BEGIN_SRC c++
template<T>
void f(ParamType arg);

f(expr);
#+END_SRC

Several cases to look at:
