content/projects/cpp_tips.md
+++
title = "C++ things to think about while programming"
author = ["Stanislav Arnaudov"]
description = "Several tips that I've explained to myself after I read Effective Modern C++"
date = 2018-07-27T00:00:00+02:00
keywords = ["c++", "programming", "code", "type-deduction", "rvalue", "lvalue", "template"]
lastmod = 2019-10-21T22:20:24+02:00
categories = ["c++"]
draft = false
weight = 100
+++

## Abstract {#abstract}

C++ is hard! C++ is even harder when you want to write good code. There are a lot of things to think about when you write code and if you don't think about them, you are probably going to mess things up. Recently I've found that one good book (see references) that gives 42 (hehe!) concrete tips on how to be a better c++ programmer. This is my summary of sorts about the contents of said book.


## The cool new things {#the-cool-new-things}


### Rvalue, lvalue and move semantics {#rvalue-lvalue-and-move-semantics}

<a id="org1edb870"></a> "Move semantics" is a thing that we have in C++ now (since C++11 actually). It makes a ton of sense once you get it but it may be a little hard to wrap your head around it. At least in the beginning, of course. First off - why do we need move-semantics? For code efficiency! If you know what you are doing, your code can run faster, with fewer object copies and fewer objects created. Second, and perhaps more importantly, what are move semantics? The way I like to think about it - the ability to distinguish between an object that won't be needed after the evaluation of an expression and the ability to do a different thing, if you are dealing with such object.<br /> Take a look at the following code:

```c++
MyObject obj1, obj2;
MyObject new_obj = obj1 + obj2;
```

Let's say that the part `obj1 + obj2` creates a new object. This new object then gets copied through the copy assignment operator of the class `MyObject`. This creates another object that is stored in the `new_object` variable. All in all, two objects were created in this situation. The object that was originally created by `obj1 + obj2` is... well, gone. We just copied it and threw it away. Shame on us! Wouldn't it have been nice, if we could have just used that object and just "moved" it in `new_obj`. Yes, yes it would! And yes, it is possible. Through move semantics. That kind of object that won't continue to live after the expression evaluation is called **rvalue** object. All other objects are **lvalue**. In the class `MyObject` we can define a special kind of constructor (move constructor) that "creates" object from rvalues, i. e. "moves" the data from the given object in **\*this**. So,

-   Lvalue - an object that can be used on the left-hand side of expression; an object with identifiable address;
-   Rvalue - an object that won't persist after the evaluation of a given expression; no identifiable address

_Note:_ Every value is either an lvalue or an rvalue!


### Auto {#auto}

Type deduction for variables. Almost the same rules as the template argument type deduction with one small caveat. Also, in a lot of cases, it allows you to write more efficient code. Example to get you going:

```c++
std::unordered_map<std::string, std::string> map;
for(auto it : map){...} //just look how simple that is!!!
```


### Smart pointers {#smart-pointers}

<a id="orgdc1a8fb"></a> For an year now, I only hear how the C++ gurus scream how raw pointers are dangerous and will probably cause memory leaks when used so... smart pointers! For the price of a tiny bit of overhead, you will make harder (but not impossible!) for yourself to do something stupid with your code. Your new two best friends are `shared_ptr<>` and `unique_ptrt<>`:

```c++
std::shared_ptr<int> int_ptr = std::maked_shared<int>(2);
std::unique_ptr<float> float_ptr = std::make_unique<float>(3.3);
```

When it comes to `unique_ptr`, it's important to know how does one transfer the ownership of an object.

```c++
void take_ownership(std::unique_ptr<float> ptr)
{
  ... // now the pointer is mine!
}
std::unique_ptr<int[]> int_arr_ptr = std::make_unique<int[]>(10);
take_ownership(std::move(int_arr_ptr));
```

`shared_ptr`, on the other hand, can share their ownership. Again, it's good to know how is this done because you can mess it up.

```c++
class PtrHolder {
public:
  void save_ptr(std::shared_ptr<int> ptr)
    {
      this->ptr_ = ptr;
    }
private:
  std::shared_ptr<int> ptr_;
}
int main(int argc, char *argv[])
{
  Ptrholder obj;
  std::shared_ptr<int> int_ptr = std::maked_shared<int>(2);
  obj.save_ptr(int_ptr); // know there are two references to the int of int_ptr
}
```

**Important:** <span class="underline">Do not</span> return or take smart pointers by reference! <br /> Creating factory methods is also relatively straightforward. Just return them by value! There is however one things to remember about `unique_ptr` - if the return type does not match the thing you are returning, you ought to use `std::move`. This holds true even, if the return of the function type is a base class and you are returning derived class (explained [here](https://stackoverflow.com/questions/39478956/how-does-returning-stdmake-uniquesubclass-work/39479117)).


### Some random abbreviations {#some-random-abbreviations}

It is a well-known fact that C++ programmers love their abbreviations. And you know what, it actually makes a lot of sense to know those. The abbreviations in the C++ world reveal some cool, useful and right out elegant concepts that everyone should know about. Also, just to be prepared, C++ programmers are really bad at naming things.

| Abbreviations | Expansion                               |
|---------------|-----------------------------------------|
| RAII          | Resource acquisition is initialization  |
| SFINAE        | Substitution failure is not an error    |
| Pimple        | Pointer to implementation               |
| CRTP          | Curiously recurring template pattern    |
| IIFE          | Immediately invoked function expression |
| RVO           | Return value optimization               |


## Tips {#tips}


### Knowing your template type deduction is a blessing. {#knowing-your-template-type-deduction-is-a-blessing-dot}

So every C++ programmer knows how you can define generic "templated" functions and then you can call them with different types of arguments. The calling itself will cause the compiler to instantiate the function by replacing the generic type with the deduced type. The thing you should know in this process - how the type is being deduced when it's not given explicitly (i. e.the function is called without the <>-brackets). <br /> So, based on `T`, `ParamType` and `expr` you have to know what type would be deduced in

```c++
template<T>
void f(ParamType arg);

f(expr);
```

There are several cases to look at.
