org/projects/cpp_tips.org
*** ParamType is a reference or a pointer
  #+BEGIN_SRC c++
  template<T>
  void f(T& arg);
  #+END_SRC
  In this case, if ~expr~ is a reference type, the reference part is ignored and the rest of the type is taken verbatim.

#+BEGIN_SRC c++
int x = 42;
const int cx = x;
const int& rx = cx;

f(x); // T is is int

f(cx); // T is const int

f(rx); // T is again const int
#+END_SRC
/Note:/ This means that depending on how ~f~ is called, this may not compile
#+BEGIN_SRC c++
template<T>
T f(T& arg)
{
  T new_var = arg;
  new_var += 5; // if T is const int, this line here will fail
  return new_var;
}
#+END_SRC
\\
If we now change the definition of ~f~ to
#+BEGIN_SRC c++
  template<T>
  void f(const T& arg);
#+END_SRC
 the things to be "ignored" during the deduction of T are the /reference/ part _and_ the /const/ part. This means that in the above examples, T will be deduced to /int/ every time.
*** ParamType is a Universal Reference
Here we are getting a little bit fancier with come cool c++11 features. We define *f* like:
#+BEGIN_SRC c++
  template<T>
  void f(T&& arg);
#+END_SRC
In this case
- if /expr/ is a lvalue, *T* and *ParamType* are deduced to be lvalue reference. This is the only case where *T* is deduced top be a reference.
#+BEGIN_SRC c++
f(x); // T is int&

f(cx); // T is cont int &

f(rx); // T is cont int &
#+END_SRC
- if /expr/ is a rvalue - the rules for reference and pointer apply. 
#+BEGIN_SRC c++
f(27); // T is int
#+END_SRC
*** ParamType is neither a reference, nor a pointer
This is just pass by value.
#+BEGIN_SRC c++
template<T>
void f(T arg);
#+END_SRC
By instantiation we ignore everything except the "pure type" (i.e. /reference/, /const/ and/or /volatile/ part are ignored)
*** Bonus
Array arguments decay to pointers so when passing arrays to template function the ~T~ will be deduced with the rules for pointers.\\
One can, however, define e reference to an array so, with this "trick" you can force your ~T~ to be deduced to array type.
#+BEGIN_SRC c++
template<T>
void f(T& arg);

int arr[13];
f(arr) // T is int[13]
       // and ParamType is int(&)[13]
#+END_SRC
"int(&)[13]" is a reference type to an array with 13 elements... myeah! With such references to arrays you can write this extraordinary function that will deduce the number of elements in an array at compile time
#+BEGIN_SRC c++
template<typename T, std::size_t N>
constexpr std::size_t arraySize(T (&)[N]) noexcept
{
  return N;
}
#+END_SRC
And... with that knowledge, you can now punish people who claim they "know C++"...ugh, plebs!
** auto type deduction is also something to thinks about
The deduction of auto while used as "type" of a local variable behaves almost exactly as deduction of template types. This means you already know the most of the rules.
#+BEGIN_SRC c++
int x = 5;
const int cx = x;
const int& rx = cx;

//case 1

auto& xx = x; //the auto is int
auto& xcx = cx; //the auto is const int
auto& xry = rx; //the auto is const int

const auto& xx = x; //the auto is int
const auto& xcx = cx; //the auto is int
const auto& xry = rx; //the auto is int


//case 2

auto&& xx = x; //the auto is int&
auto&& xcx = cx; //the auto is const int&
auto&& xry = rx; //the auto is const int&
auto&& x_rvalue = 27; // the auto is int

.
.
.
#+END_SRC
So yeah, not much new things here. Just think about what is becoming with the /auto/ in the declaration of the variable. The final type may not be the same as the thing deduced for /auto/. For that you'll have to replace the deduced type for the /auto/ in the declaration.
\\
There is however one caveat with /auto/ type deduction. Consider the snippet:
#+BEGIN_SRC c++
auto x1(27);
auto x2{27};
#+END_SRC
This compiles but the types of the variables are probably not what you expect. Both statements look the the same and while the *x1* is "well behaved" and to be expected (it is an int...surprise!), the type of x2 is ~std::initializer_list<int>~. Yes, /auto/ treats bracketed expressions differently and the general deduced type for them is ~std::initializer_list<T>~. This means that the following code won't compile
#+BEGIN_SRC c++
auto x{12, "random string"};
#+END_SRC
If you try using bracketed expression with templated function on the other side, it just won't compile even if the objects in the brackets are all of the same type. Template type deduction just cannot handle bracketed expressions.
** decltype is cool little thing
At its core ~decltype~ has a simple concept. It takes a single argument and it "returns" its type. The quotation marks are there because the thing returned thing can be used further as a part of the code. For example, you can declare new variable with given deduced from ~decltype~ type. This is possible:
#+BEGIN_SRC c++
int x = 5;
decltype(x) xx = 23; // xx now has the type of x.... just plain int
#+END_SRC
This means however, that ~decltype~ introduces whole new set of rules for deducing a type from an expression. Thankfully, those rules are pretty simple and are what you expect...mostly as I understand it, ~decltype~ gives you exactly the type that was used when declaring the argument. It returns all the refereny and consty parts. Everything!
\\
The primary use of ~decltype~ is for specifying a return type of a function that depends on the type of the incoming arguments. Imagine we want to write a generic functions that accesses a given index of given container and returns the object at the index while before that...it does "something". In this situation you can't know the type of the object at the index(its constness, its referenceness...). ~decltype~ to the rescue. Check this out:

#+BEGIN_SRC c++
template <typename Container, typename Index>
auto doSomethingAndAcess(Container& c, Index i) -> decltype(c[i])
{
  doSomething();
  return c[i];
}
#+END_SRC
The *auto* at the beginning has nothing to do with auto type deduction. It just delegates the specification of the return type of the function to the end where we have access to the parameters. I believe the whole concept is called /trailing return type/. 
\\
This is however the C++11 way of doing it. C++14 offers a sprinkle of syntactic sugar to "turn on" ~decltype~-deduction rules for auto. Namely:
#+BEGIN_SRC c++
template <typename Container, typename Index>
decltype(auto) doSomethingAndAcess(Container& c, Index i)
{
  doSomething();
  return c[i];
}
#+END_SRC
This way the type of the return statement will be used as a return type and it will be done in a ~decltype~-y kind of way.
** Prefer auto to explicit type declarations
