org/projects/cpp_tips.org
*** General advantages of ~auto~
+ The first and obvious advantage of ~auto~ is the that it spares a lot of typing. This, by extension, allows you to even not remember the types of certain things. Like,,, at this point who even knows what are the complete types of certain iterators! So, things like
   #+BEGIN_SRC c++
   template<typename It>
   void dwim(It b, It e)
   {
     while (b != e) 
     {
       typename std::iterator_traits<It>::value_type var = b*;
       b++;
     }
   }
   #+END_SRC
   become
   #+BEGIN_SRC c++
   template<typename It>
   void dwim(It b, It e)
   {
     while (b != e) 
     {
       auto var = b*;
       b++;
     }
   }
   #+END_SRC
   Awesome!
+ With ~auto~ you can define types that are known only to the compiler. Lambdas! Also, since C++14 you can also use ~auto~ with lambada's parameters.
  #+BEGIN_SRC c++
  auto derefLess = [](const auto& p1, const auto& p2){return *p1 < *p2};
  #+END_SRC
+ ~auto~ forces you to initialize your variables which is almost always something you should do.
#+BEGIN_SRC c++
int x1; //uninitialized..bad!
auto x2; // wont't compile!
auto x3 = 0; //good!
#+END_SRC
+ ~auto~ prevents you from using the wrong type. The official return type of ~std::vector<T>::size()~ is ~std::vector<int>::size_type~ but a lot of time it is approximated with /unsigned/. This may cause problems in certain situations. The problems go away if you just use ~auto~ for the type of the variable holding the return value of ~std::vector<>::size()~.
+ /foreach/-loops become easier to type _and_ you cannot mess up the type of the iterated elements. *Always* use something like:
#+BEGIN_SRC c++
std::unordered_map<std::string, int> m;
...
for (const auto& e : m ) 
{
  // e has the "most possible correct" type here
}
#+END_SRC
*** Explicitly typed initializer idiom
Sometimes ~auto~ won't give you the type you desire. In those situations it's preferable to cast the thing you are assigning to a variable to the desired type and continue with the use of auto.
#+BEGIN_SRC c++
auto ep = static_cast<float>(calcEpsilon()); // explicitly reducing double to float... good!
#+END_SRC
** nullptr is a pointer to nothing, 0 and NULL are not that
~O~ and ~NULL~ sound so logical but they are not what you probably think they are. ~0~ is a an /int/. If the compiler sees ~0~ in the context of pointer it will be interpreted as the null-pointer. There are, however, many situations where the context is not that clear. In those case, ~0~ will be treated as a simple int. 
\\
The same story with ~NULL~. Depending on the implementation it is usually some integral type and it will be treated as number in situations where you don't expect it to behave like this.
\\
All problems can be solved, if you just forget about the existence of ~NULL~ and ~0~ and start using ~nullptr~. ~nullptr~ is designed to be a pointer to nothing and pointer is the only way it can be interpreted. The following snippet demonstrates everything:
#+BEGIN_SRC c++
void f(void*);
void f(int);
void f(bool);

f(NULL); // calls f(int)

f(0); // calls f(int)

f(nullptr); // correctly calls f(void*)
#+END_SRC
Also, another added bonus to the usage of ~nullptr~ is that it is the only thing that gets properly deduced with template functions.
#+BEGIN_SRC c++
void f(void*);
template<typename Func,
         typename Mux,
         typename Ptr>
decltype(auto) loackAndCall(Func func, Mux& mutex, Ptr ptr)
{
  MuxGuard g(mutex);
  return func(ptr);
}

lockAndCall(f1,f1m, 0);       // error!
lockAndCall(f1,f1m, NULL);    // error!
lockAndCall(f1,f1m, nullptr); // finex
#+END_SRC

** Alias declarations are better than typedef
*** What even I am talking about 
Brief refresher. This is ~typedef~:
#+BEGIN_SRC c++
typedef std::unique_ptr<std::vector<int>> VecPtr;
#+END_SRC
And this is the new cool way of doing the same thing using ~using~ (alias declaration)
#+BEGIN_SRC c++
using VecPtr std::unique_ptr<std::vector<int>>;
#+END_SRC
*** Advantages of ~using~
+ When dealing with types involving function pointers, ~using~ is much easier to swallow.
#+BEGIN_SRC c++
// which one of those look like the easier to type out and remember

typedef void (*FP)(int, const std::string&);

using FP = void (*) (int, const std::string&);
#+END_SRC
+ Alias declarations can be templetized while ~typedef~ cannot. If you want to write template type with ~typedef~, you'll have to define some underling /struct/. ~using~ does not suffer from the same problem.
#+BEGIN_SRC c++
template<typename T>
using MyAllocList = std::list<T, MyAlloc<T>>

// VS.
template<typename T>
struct MyAllocList {
  typedef std::list<T, MyAlloc<T>> type;
}
#+END_SRC
It gets even worse when you want to use the type defined with ~typedef~. Then you'll have to use the trailing ~::type~ after the type.
#+BEGIN_SRC c++
template<typename T>
class Widget
{
private:
  typename MyAllocList<T>::type list;
}
#+END_SRC
Do yourself a favor, use ~using~!
*** Type transformations that come in handy
Sometimes you want to "cook" yourself some type from some already given template types. For those purposes the standard library offers some predefined type transformations:
#+BEGIN_SRC c++
std::remove_const<T>::type;
std::remove_const_t<T>;

std::remove_reference<T>::type;
std::remove_reference_t<T>;

std::add_lvalue_reference<T>::type;
std::add_lvalue_reference_t<T>;

...
#+END_SRC
** Deleted functions are to be used instead of private ones
In some cases what you want is to prevent certain functions from being called from user code. In the good old day programmers just defined such functions private. The smarter way to do the same thing nowadays is to delete the function. This can even be done from a derived class that wants to "hide" some of the functions from its base class.
#+BEGIN_SRC c++
class basic_ios: public ios_base
{
public:
  basic_ios(const basic_ios&) = delete;
  basic_ios& operator=(const basic_ios&) = delete;
}
//this deletes the copy constrctor and the assgiment operator but only for the derived class
#+END_SRC
By convention deleted functions are to be declared /public/ and not /private/.
\\
Also _any_ function could be deleted, not only member functions of a given class. With deletion you could "turn off" certain overloads of functions.
#+BEGIN_SRC c++
bool isLucky(int number);
bool isLucky(char) = delete;
bool isLucky(bool) = delete;
bool isLucky(double) = delete;

if(isLucky(2)){...} // fine
if(isLucky('2')){...} // error!
if(isLucky(true)){...} // error!
if(isLucky(2.5)){...} // error!
#+END_SRC
Without the deletions the function calls will compile and may not behave the way you expect them to because of the implicit conversations to /int/.

** Use override
