org/projects/cpp_tips.org
*** Virtual functions
Refresher again. Which functions are to be considered virtual.
- the base class function must be declared virtual.
- The base and derived function names must be _identical_.
- Parameter types of the baser and derived function must be _identical_.
- The /constness/ of the base and derived functions must be _identical_.
- The return typers and exeption specifications of the base and derived functions must be _compatible_

Inevitably you will forget those rules and you will think that you are overriding something in a "virtual" way  but you really won' bew doing that. So, the advice goes , use ~override~ to be explicit. Then you'll have compiler tell you've done something wrong.

#+BEGIN_SRC c++
class Base
{
private:
  virtual void mf1() const;
  virtual void mf2(int x);
  virtual void mf3() &;
  void mf4() const;
}

class Derived : public Base
{
private:
  virtual void mf1() override;         // won't compile
  virtual void mf2(unsigned int x) override; // won't compile
  virtual void mf3() && override;            // won't compile
  virtual void mf4() const override;         // won't compile
}
#+END_SRC
*** Overloading on rvalue and lvalue
This did you know you could overload a function bases on weather the =*this= object is r- or lvalue....me neither!
#+BEGIN_SRC c++
class Widget
{
public:
  ...
  std::vector<double>& data() & // for lvalue Widgets
    {
      return values; // return lvalue
    }

  std::vector<double> data() && // for rvalue Widgets
    {
      return std::move(values); // return rvalue
    }
};

#+END_SRC

** Think when you need const_iterator and when iterator
*** Const iterators 
Not that much to say. C++ can optimize the code much better if it deals with /constness/. Remember to put =const= before =auto= when you don't need to change the objects that you iterate.
#+BEGIN_SRC c++
for(const auto& e : container){}
#+END_SRC
Also, when you use function that take iterators to perform something that does not modify the container, use ~std::cbegin()~ and ~std::cend()~ which are the const versions of ~std::begin()~ and ~std::end()~

#+BEGIN_SRC c++
auto it = std::find(values.cbegin(), values.cend(), 1986);
auto it = std::find(std::cbegin(values), std::cend(values), 1986);
#+END_SRC
This brings the next point.
*** Want generic code, use std::begin(), std::end(),... etc
Sometimes you know that your incoming object is a container but you don' have the guarantee that the ~containe::begin()~ and ~container::end()~ methods are provided. This is the reasons to get in the habit of using ~std::begin()~ and ~std::end()~. This makes the things a lot more generic. With them you can do this:

#+BEGIN_SRC c++
template<typename C, typename V>
void findAndInsert(C& container, const V& target, const V& insert)
{
  auto it = std::find(std::cbegin(container), values::cend(container), target);
  container.insert(insert, it);
}
#+END_SRC

** noexcept is good and it is to be used carefully
Today the C++ compilers are quite the smart little things. Much smarter than before. Therefore they can optimize a lot of things and produce more efficient binary. ~noexcept~ is one of the conditions that must be met in order for a function to be "most optimizable". It means that the function _cannot_ and _won't_ emit exception at runtime,
#+BEGIN_SRC c++
void fun(int x) noexcept;
#+END_SRC
\\
Right off the start we need to say that ~noexcept~ is a part of a function's interface. Callers may examine if a function is ~noexcept~ and their behavior may depend on it. ~noexcept~ is almost as important as ~const~. Think about ~noexcept~ in each functions definition. To not declare a function ~noexcept~ is a missed opportunity to tell the compiler and everyone else that your function meets certain conditions. However, be careful, as said before ~noexcept~ is part of the interface. Whatever your choice might be, it must not be changed in the long term. Removing ~noexcept~ (or adding for that matter) to a function definition may break binary compatibility with other parts of the program that use said function. 
\\
If a exception is emitted from a ~noexcept~ function at the runtime, the program will simply terminate. So again, be careful with defining functions ~noexcept~. If your function is ~noexcept~ but in the body usage of no-~noexcept~ function is present, you might be in trouble.
\\
A function may conditionally be ~noexcept~. 
#+BEGIN_SRC c++
template<class T, size_t N>
void swap(T (&a)[N], T (&b)[N]) noexcept(noexcept(swap_el(*a,*b)));
#+END_SRC
This function is noexcept only if the condition in the ~noexcept~ block is true. In this case, only if the function swap_el applied on two elements of of the arrays a and b is ~noexcept~.

