content/projects/cpp_tips.md


### Use override {#use-override}


#### Virtual functions {#virtual-functions}

Refresher again. Which functions are to be considered virtual.

-   the base class function must be declared virtual.
-   The base and derived function names must be <span class="underline">identical</span>.
-   Parameter types of the baser and derived function must be <span class="underline">identical</span>.
-   The _constness_ of the base and derived functions must be <span class="underline">identical</span>.
-   The return types and exception specifications of the base and derived functions must be <span class="underline">compatible</span>

Inevitably you will forget those rules and you will think that you are overriding something in a "virtual" way but you really won't be doing that. So, the advice goes, use `override` to be explicit. Then you'll have compiler tell you've done something wrong.

```c++
class Base
{
private:
  virtual void mf1() const;
  virtual void mf2(int x);
  virtual void mf3() &;
  void mf4() const;
}

class Derived : public Base
{
private:
  virtual void mf1() override;               // won't compile
  virtual void mf2(unsigned int x) override; // won't compile
  virtual void mf3() && override;            // won't compile
  virtual void mf4() const override;         // won't compile
}
```


#### Overloading on rvalue and lvalue {#overloading-on-rvalue-and-lvalue}

You can also overload a function based on weather the `*this` object is a r- or lvalue:

```c++
class Widget
{
public:
  ...
  std::vector<double>& data() & // for lvalue Widgets
    {
      return values; // return lvalue
    }

  std::vector<double> data() && // for rvalue Widgets
    {
      return std::move(values); // return rvalue
    }
};

```


### Think when you need const\_iterator and when iterator {#think-when-you-need-const-iterator-and-when-iterator}


#### Const iterators {#const-iterators}

Not that much to say. C++ can optimize the code much better if it deals with _constness_. Remember to put `const` before `auto` when you don't need to change the objects that you iterate.

```c++
for(const auto& e : container){}
```

Also, when you use a function that takes iterators to perform something that does not modify the container, use `std::cbegin()` and `std::cend()` which are the const versions of `std::begin()` and `std::end()`

```c++
auto it = std::find(values.cbegin(), values.cend(), 1986);
auto it = std::find(std::cbegin(values), std::cend(values), 1986);
```

This brings the next point.


#### Want generic code, use std::begin(), std::end(),... etc {#want-generic-code-use-std-begin-std-end-dot-dot-dot-etc}

Sometimes you know that your incoming object is a container but you don't have the guarantee that the `container::begin()` and `container::end()` methods are provided. This is the reasons to get in the habit of using `std::begin()` and `std::end()`. This makes the things a lot more generic. With them you can do this:

```c++
template<typename C, typename V>
void findAndInsert(C& container, const V& target, const V& insert)
{
  auto it = std::find(std::cbegin(container), values::cend(container), target);
  container.insert(insert, it);
}
```


### noexcept is good and it is to be used carefully {#noexcept-is-good-and-it-is-to-be-used-carefully}

Today the C++ compilers are quite the smart little things. Much smarter than before. Therefore they can optimize a lot of things and produce a more efficient binary. `noexcept` is one of the conditions that must be met for a function to be "most optimizable". It means that the function <span class="underline">cannot</span> and <span class="underline">won't</span> emit exception at runtime,

```c++
void fun(int x) noexcept;
```

<br /> Right off the start, we need to say that `noexcept` is a part of a function's interface. Callers may examine if a function is `noexcept` and their behavior may depend on it. `noexcept` is almost as important as `const`. Think about `noexcept` in the definition of each function. To not declare a function `noexcept` is a missed opportunity to tell the compiler and everyone else that your function meets certain conditions. However, be careful, as said before `noexcept` is part of the interface. Whatever your choice might be, it must not be changed in the long term. Removing `noexcept` (or adding for that matter) to a function definition may break binary compatibility with other parts of the program that use said function. <br /> If an exception is emitted from a `noexcept` function at the runtime, the program will simply terminate. So again, be careful with defining functions `noexcept`. If your function is `noexcept` but in the body usage of no-`noexcept` function is present, you might be in trouble. <br /> A function may conditionally be `noexcept`.

```c++
template<class T, size_t N>
void swap(T (&a)[N], T (&b)[N]) noexcept(noexcept(swap_el(*a,*b)));
```

This function is noexcept only if the condition in the `noexcept` block is true. In this case, only if the function swap\_el applied on two elements of the arrays a and b is `noexcept`.
