org/projects/cpp_tips.org
** constexpr is the new hot thing!
~constexpr~ indicates a value(when used for variable definition) that is known during compilation. This is quite different from simply being /const/. Function parameters can be /const/ but are are not known during compilation. This:
#+BEGIN_SRC c++
constexpr int x = 5;
#+END_SRC
is on the other hand known during compilation. In this example /x/ is a /compile-time constant/. It can be used in...interesting ways. For example:
#+BEGIN_SRC c++
std::array<int, x> arr; // defines array with 5 int elements
#+END_SRC
At this point I'll have to mention that of course all ~constexpr~ object are /const/ extension. Not all /const/ objects are ~constexpr~ however.
\\
Things become a lot more interesting once ~constexpr~ functions are involved. Those create what is called a ~constexpr~ /context/. This means that those function could be parsed and executed during compilation given that the provided arguments are known during compilation(i. e. they are defined as ~constexpr~). When the conditions for compile time executions are not met, the function can also act as a normal function. In C++11 those ~constexpr~ functions were limited to a single statement - the return statement. In c++14 however this limitation is drooped. Simple example:
#+BEGIN_SRC c++
constexpr int pow(int base, int exp) noexcept
{
  auto res = 1;
  for(int i = 0; i < exp; i++) res *= base;
  return res;
}
constexpr size = 3;
std::array<double, pow(3,2)> arr; // array of size 9
#+END_SRC
When I first saw this, it blew my mind! ~constexpr~ functions may be executed in ~constexpr~ contents only if take literal type. Those include all base types except void but user defined types may also be literal if the define ~constexpr~ constructor and may be used in ~constexpr~ context if some of their methods are ~constexpr~. This is absolutely valid:
#+BEGIN_SRC c++
class Point 
{
public:
  constexpr Point(int xval = 0, int yval = 0) noexcept
    :x(xval), y(yval)
    {}

  constexpr int getX() const noexcept{return this->x;}
  constexpr int getY() const noexcept{return this->y;}
private:
  int x, y;
}
int main(int argc, char *argv[])
{
  
  constexpr Point point(5,3);
}
#+END_SRC
~point~ can be further used in ~constexpr~ functions and those could be executed during compilation. To note is that in C++11 setters for the /Point/-Class can't be ~constexpr~ as they modify the object and therefore they are not even /const/. Further more, the return types of those are /void/ which is not literal type. C++14 lifts both of these restrictions. So..
#+BEGIN_SRC c++
class Point 
{
public:
  constexpr Point(int xval = 0, int yval = 0) noexcept
    :x(xval), y(yval)
    {}

  constexpr int getX() const noexcept{return this->x;}
  constexpr int getY() const noexcept{return this->y;}

  constexpr void setX(int val) noexcept{this->x = val;}
  constexpr void setY(int val) noexcept{this->y = val;}
private:
  int x, y;
}
#+END_SRC
This gives us the ability to write something like this:
#+BEGIN_SRC c++
constexpr Point reflection(const Point& p) noexcept
{
  Point result;
  result.setX(-p.getX());
  result.setY(-p.getY());
  return result; // returning copy of the object
}
#+END_SRC
If invoked with a ~constexpr~ variable of type /Point/ the function will be evaluated at compile time. 
\\
It's important to keep in mind that ~constexpr~ is a part of a function's interface. Again, as ~noexcept~, users may rely on this interface. Also, if ~constexpr~ is used with ~constexpr~ variables in ~constexpr~ context _*and*_ it has some side effects(as I/O or simply logging something to the standard output) it will cause compile time error. So yeah, be careful. ~constexpr~ is pretty close to the new ~const~ but not quite!
\\
One final thing. Please do yourself a favor and check out [[https://www.youtube.com/watch?v=PJwd4JLYJJY][this]]! A talk with [[https://articles.emptycrate.com/about.html][Jason Turnen]] and [[https://github.com/elbeno][Ben Deane]] that shows exactly what you can do with ~constexpr~.
** The mutable keyword exists and you should know about it!
So lets say you have the following class that is used not only by you but by someone that is not you and over whom you have to direct control.
#+BEGIN_SRC c++
class ResourceProvider 
{
public:
  ResourceProvider(...){}
  
  void changeState(int x, int y)
    {
      this->x = x;
      this->y = y;
    }

  double getResource() const
    {
      return this->expensivecomputation();
    }
private:
  double expensiveComputation(int x, int y) const {...}
  double x,y;
}
#+END_SRC
Everything is perfect. The /getResource/ function is ~const~ and is has no side effect. This is as good as it gets with C++ functions. It's optimizable AF.
\\
One they however, one of the clients of the class writes you an email with complaint that the ~getResources~ function is too slow and ~changeState~ gets called relatively seldom so they end up caching the result of ~getResource~. "Wouldn't it be convenient if the class did that on its own automatically." they say. And yes! It certainty would be nice. So you change your class to:
#+BEGIN_SRC c++
class ResourceProvider 
{
public:
  ResourceProvider(...){}
  
  void changeState(int x, int y)
    {
      this->x = x;
      this->y = y;
      this->state_changed = true;
    }

  double getResource() const
    {
      if (state_changed)
      {
        cached_value = this->expensivecomputation();
        state_changed = false;
      }

      return cached_value;
    }
private:
  double expensiveComputation(int x, int y) const {...}
  double x,y;
  bool state_changed = true;
  double cached_value;
}
#+END_SRC
And....it doesn't compile. Sad! ~getResource~ has side effects now. It isn't ~const~! It can't ~const~! BAD! You have a few options now:
- remove the ~const~ from the function declaration and the hell breaks loose
- use something like ~const_cast~ and feel... like a horrible human being after the fact (plus it's really ugly to do that). I mean... you are lying with your function interface if you do that
- use ~mutable~!!
Yes ~mutable~ is completely different beast. If you define variable as ~mutable~ it can be changed from /const/ functions. Myeah! You rewrite your class.
#+BEGIN_SRC c++
class ResourceProvider 
{
public:
  ResourceProvider(...){}
  
  void changeState(int x, int y)
    {
      this->x = x;
      this->y = y;
      this->state_changed = true;
    }

  double getResource() const
    {
      if (state_changed)
      {
        cached_value = this->expensivecomputation();
        state_changed = false;
      }

      return cached_value;
    }
private:
  double expensiveComputation(int x, int y) const {...}
  double x,y;
  mutable bool state_changed = true;
  mutable double cached_value;
}
#+END_SRC
You ship it. Everyone is happy. The code is clean. You can live in peace with the new knowledge now!
