content/projects/cpp_tips.md


### constexpr is the new hot thing! {#constexpr-is-the-new-hot-thing}

`constexpr` indicates a value(when used for variable definition) that is known during compilation. This is quite different from simply being _const_. Function parameters can be _const_ but are not known during compilation. This:

```c++
constexpr int x = 5;
```

is on the other hand known during compilation. In this example _x_ is a _compile-time constant_. It can be used in interesting ways. For example:

```c++
std::array<int, x> arr; // defines array with 5 int elements
```

At this point, I'll have to mention that, of course, all `constexpr` objects are _const_ by extension. Not all _const_ objects are `constexpr` however. <br /> Things become a lot more interesting once `constexpr` functions are involved. Those create what is called a `constexpr` _context_. This means that those functions could be parsed and executed during compilation given that the provided arguments are known during compilation(i. e. they are defined as `constexpr`). When the conditions for compile-time executions are not met, the function can also act like a normal function. In C++11 those `constexpr` functions were limited to a single statement - the return statement. In C++14 however, this limitation is drooped. Simple example:

```c++
constexpr int pow(int base, int exp) noexcept
{
  auto res = 1;
  for(int i = 0; i < exp; i++) res *= base;
  return res;
}
constexpr size = 3;
std::array<double, pow(3,2)> arr; // array of size 9
```

When I first saw this, it blew my mind! `constexpr` functions may be executed in `constexpr` contents only if take literal type. Those include all base types except void but user defined types may also be literal if the define `constexpr` constructor and may be used in `constexpr` context if some of their methods are `constexpr`. This is absolutely valid:

```c++
class Point
{
public:
  constexpr Point(int xval = 0, int yval = 0) noexcept
    :x(xval), y(yval)
    {}

  constexpr int getX() const noexcept{return this->x;}
  constexpr int getY() const noexcept{return this->y;}
private:
  int x, y;
}
int main(int argc, char *argv[])
{

  constexpr Point point(5,3);
}
```

`point` can be further used in `constexpr` functions and those could be executed during compilation. To note is that in C++11 setters for the _Point_-Class can't be `constexpr` as they modify the object and therefore they are not even _const_. Further more, the return types of those are _void_ which is not literal type. C++14 lifts both of these restrictions. So..

```c++
class Point
{
public:
  constexpr Point(int xval = 0, int yval = 0) noexcept
    :x(xval), y(yval)
    {}

  constexpr int getX() const noexcept{return this->x;}
  constexpr int getY() const noexcept{return this->y;}

  constexpr void setX(int val) noexcept{this->x = val;}
  constexpr void setY(int val) noexcept{this->y = val;}
private:
  int x, y;
}
```

This gives us the ability to write something like this:

```c++
constexpr Point reflection(const Point& p) noexcept
{
  Point result;
  result.setX(-p.getX());
  result.setY(-p.getY());
  return result; // returning copy of the object
}
```

If invoked with a `constexpr` variable of type _Point_ the function will be evaluated at compile time. <br /> It's important to keep in mind that `constexpr` is a part of a function's interface. Again, as `noexcept`, users may rely on this interface. Also, if `constexpr` is used with `constexpr` variables in `constexpr` context <span class="underline">**and**</span> it has some side effects(as I/O or simply logging something to the standard output) it will cause a compile-time error. So yeah, be careful. `constexpr` is pretty close to the new `const` but not quite! <br /> One final thing. Please do yourself a favor and check out [this](https://www.youtube.com/watch?v=PJwd4JLYJJY)! A talk with [Jason Turnen](https://articles.emptycrate.com/about.html) and [Ben Deane](https://github.com/elbeno) that shows exactly what you can do with `constexpr`.


### The mutable keyword exists and you should know about it! {#the-mutable-keyword-exists-and-you-should-know-about-it}

So let's say you have the following class that is used not only by you but by someone that is not you and over whom you have to direct control.

```c++
class ResourceProvider
{
public:
  ResourceProvider(...){}

  void changeState(int x, int y)
    {
      this->x = x;
      this->y = y;
    }

  double getResource() const
    {
      return this->expensivecomputation();
    }
private:
  double expensiveComputation(int x, int y) const {...}
  double x,y;
}
```

Everything is perfect. The _getResource_ function is `const` and it has no side effect. This is as good as it gets with C++ functions. It's optimizable AF. <br /> One they, however, one of the clients of the class writes you an email with the complaint that the `getResources` function is too slow and `changeState` gets called relatively seldom so they end up caching the result of `getResource`. "Wouldn't it be convenient if the class did that on its own automatically," they say. And yes! It certainly would be nice. So you change your class to:

```c++
class ResourceProvider
{
public:
  ResourceProvider(...){}

  void changeState(int x, int y)
    {
      this->x = x;
      this->y = y;
      this->state_changed = true;
    }

  double getResource() const
    {
      if (state_changed)
      {
        cached_value = this->expensivecomputation();
        state_changed = false;
      }

      return cached_value;
    }
private:
  double expensiveComputation(int x, int y) const {...}
  double x,y;
  bool state_changed = true;
  double cached_value;
}
```

And....it doesn't compile. Sad! `getResource` has side effects now. It isn't `const`! It can't `const`! BAD! You have a few options now:

-   remove the `const` from the function declaration and the hell breaks loose
-   use something like `const_cast` and feel... like a horrible human being after the fact (plus it's really ugly to do that). I mean... you are lying with your function interface if you do that
-   use `mutable`!!

Yes `mutable` is completely different beast. If you define variable as `mutable` it can be changed from _const_ functions. Myeah! You rewrite your class.

```c++
class ResourceProvider
{
public:
  ResourceProvider(...){}

  void changeState(int x, int y)
    {
      this->x = x;
      this->y = y;
      this->state_changed = true;
    }

  double getResource() const
    {
      if (state_changed)
      {
        cached_value = this->expensivecomputation();
        state_changed = false;
      }

      return cached_value;
    }
private:
  double expensiveComputation(int x, int y) const {...}
  double x,y;
  mutable bool state_changed = true;
  mutable double cached_value;
}
```

You ship it. Everyone is happy. The code is clean. You can live in peace with the new knowledge now! Also, watch [this](https://www.youtube.com/watch?v=tTexD26jIN4) talk by [Kate Gregory](http://www.gregcons.com/kateblog/). She goes over the problem presented here in much more engaging fashion.
