content/projects/cpp_tips.md


### std::unique\_ptr is for exclusive ownership! {#std-unique-ptr-is-for-exclusive-ownership}

Generally, when you want to use a pointer in the new modern C++ world, your first thought should be "Can I use `unique_ptr` here?". And yes, this is the preferred way of using "pointers" these days. `unique_ptr` can be viewed as small as a raw pointer and for most operations, they behave exactly the same way as raw pointers. <br /> There are few things to keep in mind while using `unique_ptr`.

-   `unique_ptr` embodies exclusive ownership. Every `unique_ptr` that is not empty "owns" the resource it's holding and you have a guarantee (generally) that this is the only object holding a pointer to the underlying object. The `unique_ptr` cannot be copied as this would create another holder of the resource so `unique_ptr`-s are only movable
-   You can know <span class="underline">exactly</span> when an `unique_ptr` object would be destroyed and with that the resource released. It is said that one of the greatest features of C++ is the closing brackets `}`. In order words, the fact that you know the exact moment at which an object will be destroyed and the destructor of the class will be executed for this object. The ramifications for `unique_ptr` is that the object will be destroyed when the enclosing scope comes to an end. Of course, you could move the `unique_ptr` before that and transfer its ownership to some other part of the program. The moving was talked about in the [beginning](#orgdc1a8fb).

<br /> A typical use of `unique_ptr` are the factory methods. The factory function could even return different type (from some hierarchy, of course) of an object depending on the inputs input parameters.

```c++
class Base {}
class D1 : public Base {}
class D2 : public Base {}

std::unique_ptr<Base> createObj(int param1, double param2)
{
  if (...)
    return std::make_unique<D1>();
  else
    return std::make_unique<D2>();
}
```

<br /> Another thing to know about `unique_ptr` is its ability to define custom deleter for the object. Normally `unique_ptr` uses simple `delete` to destroy the resource it's holding to but this behavior could be overridden.

```c++
auto del_base = [](Base *object){
                 makeLog(object);
                 ...
                 delete object;
               };
std::unique_ptr<Base, decltype(del_base)> ptr(new Base(), del_base);
```


### std::shared\_ptr is for shared ownership! {#std-shared-ptr-is-for-shared-ownership}

Not having garbage collection in C++ is a curse and a blessing at the same time. The knowledge of when exactly your objects are being destroyed and memory released gives you quite the freedom to write high performing code. On the other hand, this freedom comes with a lot of pitfalls and potential problems that you can introduce into your program. `shared_ptr` aims to provide you with "garbage collection"-like solution while staying true to the C++ "optimize everything" principles. <br /> `shared_ptr` implements a reference counting system. Several different `shared_ptr` objects can hold a pointer to the same underlying resource. The resource will be destroyed only then when all `shared_ptr` have exited their respective scopes (i.e. are destroyed). There is a little bit of overhead once you bring the whole _reference_-spiel. The important things to keep in mind:

-   `shared_ptr` are twice the size of a raw pointer
-   memory for the reference count must be dynamically allocated
-   Increments and decrements of the reference count must be atomic
-   Constructing a `shared_ptr` usually increments the reference count. Why usually? Because move-construction is also construction but it doesn't actually produce "new object". The pointer of the old object (the one we are moving from) is just set to _null_. and the new object takes its place in the world so no new reference is actually created.
-   Each resource that is managed through `shared_ptr` has what is called a _control block_. There the `shared_ptr` meta-information about he pointer it holds(reference count, custom delete... ). The _control block_ is allocated on the heap
    -   `std::make_shared` always creates new _control block_
    -   A _control block_ is also created when the `shared_ptr` object is constructed from a unique-ownership pointer (`unique_ptr`).
    -   A _control block_ is created even when you pass a raw pointer to the constructor of the `shared_ptr`. If you want a new `shared_ptr` that manages the same resource, you should copy-construct it from another `shared_ptr`

The last point is kinda important. You have to think about the control blocks that are created or else you could end up with several control blocks for the same resource which is a perfect recipe for undefined behavior. Look the following code

```c++
std::vector<std::shared_ptr<Widget>> processed;
...
class Widget
{
public:
  void process()
    {
      processed.emplace_back(this);// bad!!!
    }
}
```

The part that is wrong is the passing of a raw pointer to a container of `shared_ptr`-s. This will create a new control block which <span class="underline">could</span> be not bad but if there are other `sahred_ptr`-s in some other part of the program that already have control block for the `*this` object... **undefined behavior**!! This is, however, a problem that was thought about and a solution exists. Introducing `std::enable_shared_from_this<T>`. Weird name but it does the trick. If a class inherits from this thing, then it is safe to create `shared_ptr` from the `this` pointer. The safe code looks like:

```c++
class Widget : public std::enable_shared_fro_this<Widget>
{
public:
  void process()
    {
      processed.emplace_back(shared_from_this());// good!!!
    }
}
```
