org/projects/cpp_tips.org
** Pimpl and the proper way to use it. 
Ever herd of [[http://www.learncpp.com/cpp-tutorial/17-forward-declarations/][forward declaration]]. If not go check it out. The Pimpl idiom kinda solves the same problem. If you don't want to clutter your header files with the header files of the classes that you use, you can "deffer" this "implementation detail" to the ~.cpp~ file. Check this out:
#+BEGIN_SRC c++
//Wifget.hpp
class Widget
{
  Widget();
  ~Widget();

private:
  struct Impl;
  Impl impl*;
}
//Wifget.cpp

#include <iostream>
#include <string>

#include "Gadget.hpp"
#include "Widget.hpp"

struct Widget::Impl
{
  std::sting name;
  Gadget g1, g2, g3;
  std::vecotr<double> data;
}

Widget::Widget()
  :impl(new Impl);

Widget::~Widget()
{
  delete impl;
}
#+END_SRC
Notice how in ~Widget.hpp~ we didn't have to include a single header. There is no mention of the headers for the fields in the implementation of the class. The implementation appears only in he ~.cpp~ file. This can potentially speed up compilation times as it reduces the compile-dependencies between the classes.
\\
Now to utilize C++14 we can rewrite the class to use ~uniqe_ptr~ for the implementation and write our necessary constructors.
#+BEGIN_SRC c++
//Wifget.hpp
class Widget
{
  Widget();
  Widget(const Widget& rhs);
  Widget& operator=(const Widget& rhs);
  Widget(const Widget&& rhs);
  Widget& operator=(Widget&& rhs);
  ~Widget();

private:
  struct Impl;
  std::uniqe_ptr<Impl> impl;
}
//Wifget.cpp

#include <iostream>
#include <string>

#include "Gadget.hpp"
#include "Widget.hpp"

  struct Widget::Impl{..}

    Widget::Widget()
      :impl(std::make_unique<Widget::Impl>()){};

Widget::Widget(const Widget&& rhs) = default;
Widget::operator=(Widget&& rhs) = default;
Widget::~Widget() = default;

Widget::Widget(const Widget& rhs) :
  impl(std::make_unique<Widget::Impl>(*rhs.impl)){}

Widget& Widget::operator=(const Widget& rhs) 
{
  ,*impl = *rhs.impl;
  return *this;
}
#+END_SRC
/Note:/ Use your header for only for declaration when possible. Also ~= defualt~ is _implementation_ so put in the ~.cpp~ file, not in the header. If in this case you did that in the header file, the compiler would not how to generate the move constructor and the move assignment operator as implementation of the calls is _not_ in the header. In the header the ~struct Impl~ is incomplete and ~*impl~ is pointer to incomplete type so the compiler could not deal with that.
\\
The compiler happily generates the move constructors for us as the default implementation is exactly the thing we want. Just perform /move/ on the implementation. The default copy constructors however would only perform shallow copy of the object so we have to write them ourselves.
\\
The detractor is also the default one because we have no code to put in it. The ~unique_ptr~ automatically deletes its contents once it is destroyed. 
** std::forward and std::move are quite interesting.
<<sec:move-forward>>
Ok, hopefully by now you at least have heard of *move semantics*. Inevitably you've also probably seen ~std::move()~ and ~std::forward<T>()~ used in some weird way and wondered "What the hell is happening here?". First thing to understand about hose functions - they are functions that don't do much in run-time. They don't generate code. The don't "move". At their core, those functions are casts. They cast /rvalue/ object to /lvalue/ ones. Refer to one of the [[sec:move-semantics][intro sections]] for more information about what are those. The difference between ~std::move()~ and ~std::forward<T>()~ is that they perform the cast under different conditions. ~std::move()~ performs it always with no conditions. ~std::forward<T>()~ casts to revalue only if a certain conditions is met - if the argument is bind to rvalue.
\\
Yes, it is well known and by this point accepted fact that ~std::move()~ has confusing AF name but... just roll with it and it will grow on you. ~std::move()~ doesn't actually move anything. ~std::move()~ merely makes an object eligible for moving. This is no guarnatee however that an object will be moved from. Consider this:
#+BEGIN_SRC c++
class Anotation
{
private:
  std::string text;
public:
  Anotation(const std::string name): text(std::move(name)){}
  //this doesn't do what it seems to do
}
Anotation("ano");
#+END_SRC
Think about what is happening here. We are passing a string to the constructor which takes it by value and "moves" its content inside the ~text~ field. But there is also ~const~. This means that the result of the ~std::move(name)~ is /rvalue const std::string/. The constness is still there. This means that the move constructor of ~std::string~ _cannot_ be used as it will change the object that it takes which is /const/. For that reason the ordinary constructor is called and the value is just copied and not moved. The lesson to be learned here - rvalue objects will not be moved sorely on the fact that they are /rvalue/s. They also must be /const/.
\\
As already said ~std::forward<T>()~ only casts to rvalue is the argument is bind to rvalue object. ~std::forward<T>()~ is typically used in cases where /perfect forwarding/ is required. That is, a function takes some arguments and those are automatically /lvalue/ in the function body even if the fiction is invoked with /rvalue/s. In the body however, you may want to "forward" the argument to other functions that may need to differentiate between /r-/ and /lvalues/. In this case one would use ~std::forward<T>()~. Example:
#+BEGIN_SRC c++
template<typename T>
void logAndProcess(T&& param)
{
  auto now = std::chrono::system_clock::now();
  makeEntry("Calling process", now);
  /* Here we dont't know whether the function was invoed
   with rvalue or lvalue. Therefore we forward the
   argument perfectly */
  process(std::forward<T>(param));
}
#+END_SRC
** Universal references and rvalue references
First things first - "universal reference" is a lie. There is no such thing in the official C++ specification. There there is "forwarding reference". "Forwarding reference" is absolutely the same thing as what Scott Meyers means with "universal reference" in his book. Here I will also use universal reference. OK? OK. Good that now this is out of the way.
\\
So we know that we can define functions that take rvalue references like
#+BEGIN_SRC c++
void f(Widget&& param);
#+END_SRC
Here ~param~ is /rvalue/ reference and it binds only to /rvalue/ objects. Consider on the other hand this function:
#+BEGIN_SRC c++
template<typename T>
void g(T&& param);
#+END_SRC
Here param can bind to /rvalues/ _and_ to /lvalues/. This is what makes it /universal reference/. 
\\
For a reference to be universal one certain condition must be met
1. Type deduction must occur
2. The reference must have exactly the form "T&&". No ~const~, no nothing. Just "T&&".
If the ~const~ qualifier is used for the function parameter, it(the parameter) will "collapse" /rvalue const reference/ which pretty useless on itself as we say in the [[sec:move-forward][previous tip]].
\\
As stated if universal reference is bound to rvalue, it is an rvalue reference and lvalue reference if it's bound to lvalue. This means that universal references are exactly thing to be used with ~std::forward<T>()~.
