content/projects/cpp_tips.md


### Pimpl and the proper way to use it. {#pimpl-and-the-proper-way-to-use-it-dot}

Ever heard of [forward declaration](http://www.learncpp.com/cpp-tutorial/17-forward-declarations/). If not go check it out. The Pimpl idiom kinda solves the same problem. If you don't want to clutter your header files with the header files of the classes that you use, you can "deffer" this "implementation detail" to the `.cpp` file. Check this out:

```c++
//Wifget.hpp
class Widget
{
  Widget();
  ~Widget();

private:
  struct Impl;
  Impl impl*;
}
//Wifget.cpp

#include <iostream>
#include <string>

#include "Gadget.hpp"
#include "Widget.hpp"

struct Widget::Impl
{
  std::sting name;
  Gadget g1, g2, g3;
  std::vecotr<double> data;
}

Widget::Widget()
  :impl(new Impl);

Widget::~Widget()
{
  delete impl;
}
```

Notice how in `Widget.hpp` we didn't have to include a single header. There is no mention of the headers for the fields in the implementation of the class. The implementation appears only in the `.cpp` file. This can potentially speed up compilation times as it reduces the compile-dependencies between the classes. <br /> Now to utilize C++14 we can rewrite the class to use `uniqe_ptr` for the implementation and write our necessary constructors.

```c++
//Wifget.hpp
class Widget
{
  Widget();
  Widget(const Widget& rhs);
  Widget& operator=(const Widget& rhs);
  Widget(const Widget&& rhs);
  Widget& operator=(Widget&& rhs);
  ~Widget();

private:
  struct Impl;
  std::uniqe_ptr<Impl> impl;
}
//Wifget.cpp

#include <iostream>
#include <string>

#include "Gadget.hpp"
#include "Widget.hpp"

  struct Widget::Impl{..}

    Widget::Widget()
      :impl(std::make_unique<Widget::Impl>()){};

Widget::Widget(const Widget&& rhs) = default;
Widget::operator=(Widget&& rhs) = default;
Widget::~Widget() = default;

Widget::Widget(const Widget& rhs) :
  impl(std::make_unique<Widget::Impl>(*rhs.impl)){}

Widget& Widget::operator=(const Widget& rhs)
{
  *impl = *rhs.impl;
  return *this;
}
```

_Note:_ Use your header only for a declaration when possible. Also, `= defualt` is <span class="underline">implementation</span> so put in the `.cpp` file, not in the header. If in this case, you did that in the header file, the compiler would not how to generate the move constructor and the move assignment operator as an implementation of the calls is <span class="underline">not</span> in the header. In the header the `struct Impl` is incomplete and `*impl` is a pointer to incomplete type so the compiler could not deal with that. <br /> The compiler happily generates the move constructors for us as the default implementation is exactly the thing we want. Just perform _move_ on the implementation. The default copy constructors, however, would only perform a shallow copy of the object so we have to write them ourselves. <br /> The detractor is also the default one because we have no code to put in it. The `unique_ptr` automatically deletes its contents once it is destroyed.


### std::forward and std::move are quite interesting. {#std-forward-and-std-move-are-quite-interesting-dot}

<a id="org2e5602b"></a> Ok, hopefully by now you at least have heard of **move semantics**. Inevitably you've also probably seen `std::move()` and `std::forward<T>()` used in some weird way and wondered "What the hell is happening here?". The first thing to understand about hose functions - they are functions that don't do much in run-time. They don't generate code. They don't "move". At their core, those functions are casts. They cast _rvalue_ object to _lvalue_ ones. Refer to one of the [intro sections](#org1edb870) for more information about what are those. The difference between `std::move()` and `std::forward<T>()` is that they perform the cast under different conditions. `std::move()` performs it always with no conditions. `std::forward<T>()` casts to revalue only if a certain condition is met - if the argument is bind to rvalue. <br /> Yes, it is well known and by this point accepted fact that `std::move()` has confusing AF name but... just roll with it and it will grow on you. `std::move()` doesn't actually move anything. `std::move()` merely makes an object eligible for moving. This is no guarantee however that an object will be moved from. Consider this:

```c++
class Anotation
{
private:
  std::string text;
public:
  Anotation(const std::string name): text(std::move(name)){}
  //this doesn't do what it seems to do
}
Anotation("ano");
```

Think about what is happening here. We are passing a string to the constructor which takes it by value and "moves" its content inside the `text` field. But there is also `const`. This means that the result of the `std::move(name)` is _rvalue const std::string_. The constness is still there. This means that the move constructor of `std::string` <span class="underline">cannot</span> be used as it will change the object that it takes which is _const_. For that reason, the ordinary constructor is called and the value is just copied and not moved. The lesson to be learned here - rvalue objects will not be moved sorely on the fact that they are _rvalue/s. They also must be /const_. <br /> As already said `std::forward<T>()` only casts to rvalue if the argument is bound to rvalue object. `std::forward<T>()` is typically used in cases where _perfect forwarding_ is required. That is, a function takes some arguments and those are automatically _lvalue_ in the function body even if the fiction is invoked with _rvalue/s. In the body, however, you may want to "forward" the argument to other functions that may need to differentiate between /r-_ and _lvalues_. In this case, one would use `std::forward<T>()`. Example:

```c++
template<typename T>
void logAndProcess(T&& param)
{
  auto now = std::chrono::system_clock::now();
  makeEntry("Calling process", now);
  /* Here we dont't know whether the function was invoed
   with rvalue or lvalue. Therefore we forward the
   argument perfectly */
  process(std::forward<T>(param));
}
```


### Universal references and rvalue references {#universal-references-and-rvalue-references}

First things first - "universal reference" is a lie. There is no such thing in the official C++ specification. There there is "forwarding reference". "Forwarding reference" is absolutely the same thing as what Scott Meyers means with "universal reference" in his book. Here I will also use universal reference. OK? OK. Good that now this is out of the way. <br /> We know that we can define functions that take rvalue references like:

```c++
void f(Widget&& param);
```

Here `param` is _rvalue_ reference and it binds only to _rvalue_ objects. Consider on the other hand this function:

```c++
template<typename T>
void g(T&& param);
```

Here param can bind to _rvalues_ <span class="underline">and</span> to _lvalues_. This is what makes it _universal reference_. <br /> For a reference to be universal one certain condition must be met

1.  Type deduction must occur
2.  The reference must have exactly the form "T&&". No `const`, no nothing. Just "T&&".

If the `const` qualifier is used for the function parameter, it(the parameter) will "collapse" _rvalue const reference_ which pretty useless on itself as we say in the [previous tip](#org2e5602b). <br /> As stated if universal reference is bound to "rvalue", it is an "rvalue"-reference and "lvalue"-reference if it's bound to an "lvalue". This means that universal references are exactly the things to be used with `std::forward<T>()`.
