org/projects/cpp_tips.org
** /Pass by value/ is not what your first C++ book would have you believe
Maybe this is exclusive to me but when I was learning C++ I was left with the impression that passing things by value is kinda dumb if you can pass it by reference. I mean, who needs the extra copy, right?! Not quite. Consider the case of a simple setter
#+BEGIN_SRC c++
class Widget
{
  void setName(const std::string& name)
    {
      this->name = name;
    }
}
#+END_SRC
What you actually are doing is:
- take a string by reference
- copy it in the field ~name~
The copy is till there! It's just that _you_ perform the copying and not the compiler. Not this is kinda dumb! The compiler _is_ smarter than you. After the compiler has copied the value from the caller in the function's parameter we can - enter modern C++ - /move/ it in the corresponding field:
#+BEGIN_SRC c++
class Widget
{
  void setName(std::string name)
    {
      this->name = std::move(name);
    }
}
#+END_SRC
Now this looks like good modern c++. Copying... is not that bad as might you think. Compilers are pretty good these days. Do not be mislead. A copy of a single string has virtually no overhead.
\\
Still, there still exists a time and place for passing by /const references/. If you actually don't need a copy of the passed argument, then there is no reason for pass-by-value
#+BEGIN_SRC c++
class Widget
{
  void process(const Gadget& gadget)
    {
      // now we can only use const functions of Gadget
      if(gadget.getNumberOfTicks){....}
    }
}
#+END_SRC
Passing pure references also makes sense in some situations:
#+BEGIN_SRC c++
std::vector<std::string> names;
void populate(std::string& name)
{
  name.pusb_back("Stanislv");
  name.pusb_back("Marina");
}
populete(names);
#+END_SRC
To summarize (taken from an answer from [[https://stackoverflow.com/questions/7592630/is-pass-by-value-a-reasonable-default-in-c11][this]] StackOverflow question)

|--------------------+----------------------------|
|--------------------+----------------------------|
| Signature          | Use                        |
|--------------------+----------------------------|
|--------------------+----------------------------|
| bar(foo f);        | want to obtain a copy of f |
|--------------------+----------------------------|
| bar(const foo& f); | want to read f             |
|--------------------+----------------------------|
| bar(foo& f);       | want to modify f           |
|--------------------+----------------------------|
|--------------------+----------------------------|
|                    |                            |
** Return value optimization(RVO) - don't return std:::move of local variable
With your awesome new knowledge about move semantics you can now write highly optimized, high performing code that will go \*whoosh\* past those pesky languages running on virtual machines. You will however be tempted to make some "optimizations" at places where you really shouldn't mess with the compiler. Please always repeat to yourself  "The compiler is smarter than me!".
\\
Consider the following stub snippet:
#+BEGIN_SRC c++
Widget makeWIdget()
{
  Widget w;
  ...;
  return w;
}
#+END_SRC
We are creating a local variable in a function and we are returning it by value. We think about what is happening. The object is created - construction, the object is returned by value - we _copy_ out new object and return the copy because the local object will be destroyed once the scope of the function ends. Copy! We know what /rvlaues/ are. We don't need no copy. We can move! We rewrite the code like:
#+BEGIN_SRC c++
Widget makeWIdget()
{
  Widget w;
  ...;
  return std::move(w);
}
#+END_SRC
Awesome, we saved ourselves one copy! *Wrong!!!*
\\
Introducing /Return Value Optimization/. At some situations(most of them) the compiler will notice that you are returning local variable by value. If certain conditions are met, the compiler will construct this local object in the exact place in memory where the return value of the function will reside after the function is invoked. In such cases, with the return statement won't produce copy _nor_ will move construction would be necessary. This is good! The conditions that should be met for RVO to occur:
1. The type of the local object must be the same as the return value.
2. The local object is being returned.
3. The type is move constructable.
What happens when we ~std::move~ the local object - we crate reference to it and RVO can't be performed. So, *don't* return ~std::move~!
\\
Ok, but still. RVO is just an optimization. Maybe the compiler won't be able to figure out which local object we want to return and will punish us with copy while returning. No! Again - "The compiler is smarter than me!". Return values are _always_ treated as /rvalues/. So when the your function is:
#+BEGIN_SRC c++
Widget makeWIdget()
{
  Widget w;
  ...;
  return w;
}
#+END_SRC
_and_ the compiler can't do RVO, what it effectively sees is :
#+BEGIN_SRC c++
Widget makeWIdget()
{
  Widget w;
  ...;
  return std::move(w);
}
#+END_SRC
So no. You would never need to return with ~std::move~ of local object.
** std::async is something that exists and it's generally to be preferred over std::thread.
A lot times you will want to run something asynchronously in your program. C++ and the standard library make this relatively easy and give you two approaches.
- ~std::thread~ - for /thread-based/ strategy
- ~std::async~ - for /task-based/ strategy
In general you should prefer ~std::async~. It works on higher level of abstraction than ~std::thread~ and it hides some of the details that you can mess up and delegates them to the implementation. The basic asynchronous call goes like:
#+BEGIN_SRC c++
int doAsyncWork();

auto fut = std::async(doAsyncWork); // fut is a future
#+END_SRC
Further reason why ~std::async~ is better is because with it, we can get result from the function that we are calling asynchronously through the future's /get/ method. There isn't really a straight forward  way of extracting result from separate thread constructed with ~std::thread~.
\\
If you opt to use thread base programming you'll have to deal with thread exhaustion, over-subscription, load balancing, abd adaptation to new platforms. And you know...all of these are suuuper fun to deal with. You may have to do it sometimes thou. As stated, threads are lower level concurrency API. Threads may allow you to write more efficient code suited to your specific needs. Cases where threads may be necessary
- You want to mess directly with the concurrency API provided by the OS. Given this would be pretty hard, it could potentially lead to tremendous speed when done write. Essentially you would have to define the way how your program communicates with the OS as "real" threads are managed by it.
- You know exactly what your needs are and you want to deal with threads and build the whole mutli-threading and asynchronous code/system yourself. This is pretty doable and could be nice learning experience. You probably will implement something that already exists but hey, that's how you learn new things and I would actually encourage this.
- If you are implementing some concurrency technology that is not offered by C++, yeah you bet you'll need to use threads and deal with them.

