org/projects/cpp_tips.org
* Conclusion
I just want to say one thing. Never, never ever say that you "know C++" and be deeply sceptical of people who use the said expression. C++ is complex and you can do everything in a lot of different ways and probably things are going to work no matter what. HOWEVER, some solutions in C++ are very clearly better than others and a lot of times it is not clear what is the "optimal" way of achieving your goal. Do not be mislead by your own knowledge! C++ offers you an ever expanding world of good\bad solutions and knowing everything that there is to know is most likely infeasible. And you know what, that's actually OK. Because let's face it, software engineering is all about learning something new everyday in the process of horribly breaking your code.
* References
I'm very thankfully to these sources:
- [[https://www.amazon.de/Effective-Modern-Specific-Ways-Improve/dp/1491903996][Effective modern C++]] - the book am talking about in this post
- [[https://www.chromium.org/developers/smart-pointer-guidelines][Smart pointers guidelines]] - a very useful guide on how to be smart with your smart pointers
- [[https://www.internalpointers.com/post/understanding-meaning-lvalues-and-rvalues-c][Understanding the meaning of lvalue or rvalues]] - a good blog post that will walk you through the usages and meaning of move semantics and how are they implemented through /rvalue/ and /lvalue/. 
Check them out if you want to be a better C++ programmer.


