content/projects/cpp_tips.md


## Conclusion {#conclusion}

I just want to say one thing. Never, never say that you "know C++" and be deeply skeptical of people who use the said expression. C++ is complex and you can do everything in a lot of different ways and probably things are going to work no matter what. However, some solutions in C++ are very clearly better than others and a lot of times it is not clear what is the "optimal" way of achieving your goal. Do not be mislead by your knowledge! C++ offers you an ever-expanding world of good\bad solutions and knowing everything that there is to know is most likely infeasible. And you know what, that's actually OK. Because let's face it, software engineering is all about learning something new every day in the process of horribly breaking your code.


## References {#references}

I'm very thankful to these sources:

-   [Effective modern C++](https://www.amazon.de/Effective-Modern-Specific-Ways-Improve/dp/1491903996) - the book am talking about in this post
-   [Smart pointers guidelines](https://www.chromium.org/developers/smart-pointer-guidelines) - a very useful guide on how to be smart with your smart pointers
-   [Understanding the meaning of lvalue or rvalues](https://www.internalpointers.com/post/understanding-meaning-lvalues-and-rvalues-c) - a good blog post that will walk you through the usages and the meaning of move semantics and how are they implemented through _rvalue_ and _lvalue_.

Check them out if you want to be a better C++ programmer.
